#+STARTUP: indent showall

** Example

So, the first step is to define the metaclass and describe what options you want to have.

#+BEGIN_SRC lisp
(def-extra-options-metaclass example-metaclass
    ((start :initform nil ; `:coalescence', by default, is `replace-or-inherit'
            :type integer)
     (validates :coalescence bound-only-once
                :type boolean)))
#+END_SRC
 
For each option, other than its name, you can specify: 
- ~type~, 
- ~initform~ (if not set, the option's value will be unbound, as expected) and
- ~coalescence~ (see [[*Inheritence and Coalescence][Inheritence and Coalescence]] below).

Now, a class with this metaclass will have ~:start~ and ~:validates~ options:

#+BEGIN_SRC lisp
(defclass alpha ()
  ((zulu :initform 22
         :start 55
         :validates t))
  (:metaclass example-metaclass))
#+END_SRC

Before you can inspect the class, finalize it first (or simply instantiate its object): ~(c2mop:ensure-finalized (find-class 'alpha))~. Now, you can access the slot definition:

#+BEGIN_SRC lisp
(let ((zulu-definition (find 'zulu (c2mop:class-slots (find-class 'alpha))
                             :key #'c2mop:slot-definition-name)))
  (values (slot-definition-start zulu-definition)
          (slot-definition-validates zulu-definition)))
#+END_SRC

#+RESULTS:
: 55, T

As you can see, the ~def-extra-options-metaclass~ has defined ~slot-definition-start~ and ~slot-definition-validates~.

